In [1]:
import numpy as np
import pandas as pd

In [2]:
var_a = 3

In [3]:
var_b = var_a

In [4]:
var_b

3

In [5]:
var_a = 4

In [6]:
var_b

3

In [1]:
label = ['satu','dua','tiga']

In [2]:
angka = [10,20,30]

In [5]:
np_angka = np.array(angka)

In [6]:
np_angka

array([10, 20, 30])

In [7]:
d = {'satu':10, 'dua':20, 'tiga':30}

In [11]:
dataku = pd.Series(data=angka, index=label)

In [13]:
dataku

satu    10
dua     20
tiga    30
dtype: int64

In [15]:
dataku[0]

10

In [18]:
np_angka[0]

10

In [19]:
pd.Series(d)

satu    10
dua     20
tiga    30
dtype: int64

In [21]:
pd.Series(np_angka)

0    10
1    20
2    30
dtype: int32

In [22]:
pd.Series(angka)

0    10
1    20
2    30
dtype: int64

In [24]:
dataku.to_frame()

       0
satu  10
dua   20
tiga  30

In [25]:
dataku = dataku.to_frame()

In [26]:
dataku

       0
satu  10
dua   20
tiga  30

In [27]:
d2 = {'satu':10, 'dua':20, 'tiga':30, 'empat':40, 'lima':50}

In [28]:
dataku = pd.Series(d)

In [29]:
dataku2 = pd.Series(d2)

In [34]:
dataku

satu    10
dua     20
tiga    30
dtype: int64

In [31]:
dataku

satu    10
dua     20
tiga    30
dtype: int64

In [32]:
dataku + dataku2

dua      40.0
empat     NaN
lima      NaN
satu     20.0
tiga     60.0
dtype: float64

# DataFrame

In [3]:
np.random.seed(100)

In [4]:
dataku = pd.DataFrame(np.random.randn(3,5), ['A', 'B','C'], ['satu', 'dua', 'tiga', 'empat', 'lima'])

In [5]:
dataku

       satu       dua      tiga     empat      lima
A -1.749765  0.342680  1.153036 -0.252436  0.981321
B  0.514219  0.221180 -1.070043 -0.189496  0.255001
C -0.458027  0.435163 -0.583595  0.816847  0.672721

In [6]:
dataku['dua']

A    0.342680
B    0.221180
C    0.435163
Name: dua, dtype: float64

In [10]:
dataku['baru'] = dataku['empat'] + dataku['lima']

In [11]:
dataku.drop('tiga', axis=1)

       satu       dua     empat      lima      baru
A -1.749765  0.342680 -0.252436  0.981321  0.728885
B  0.514219  0.221180 -0.189496  0.255001  0.065506
C -0.458027  0.435163  0.816847  0.672721  1.489568

In [12]:
dataku = dataku.drop('tiga', axis=1)

In [14]:
dataku.drop('baru', axis=1, inplace=True)

In [15]:
dataku

       satu       dua     empat      lima
A -1.749765  0.342680 -0.252436  0.981321
B  0.514219  0.221180 -0.189496  0.255001
C -0.458027  0.435163  0.816847  0.672721

In [16]:
dataku.drop('B', axis=0, inplace=True)

In [17]:
dataku

       satu       dua     empat      lima
A -1.749765  0.342680 -0.252436  0.981321
C -0.458027  0.435163  0.816847  0.672721

In [18]:
dataku.shape

(2, 4)

In [19]:
dataku < 0

   satu    dua  empat   lima
A  True  False   True  False
C  True  False  False  False

In [20]:
dataku_bol = dataku < 0

In [21]:
dataku_bol

   satu    dua  empat   lima
A  True  False   True  False
C  True  False  False  False

In [23]:
dataku[dataku_bol]

       satu  dua     empat  lima
A -1.749765  NaN -0.252436   NaN
C -0.458027  NaN       NaN   NaN

In [24]:
dataku[dataku < 0]

       satu  dua     empat  lima
A -1.749765  NaN -0.252436   NaN
C -0.458027  NaN       NaN   NaN

In [45]:
dataku = pd.DataFrame(np.random.randn(3,5), ['A', 'B','C'], ['satu', 'dua', 'tiga', 'empat', 'lima'])

In [46]:
dataku

       satu       dua      tiga     empat      lima
A -0.450176  0.132428  0.022214  0.317368 -0.752414
B -1.296392  0.095139 -0.423715 -1.185984 -0.365462
C -1.271023  1.586171  0.693391 -1.958081 -0.134801

In [47]:
dataku[dataku['tiga'] > 0]

       satu       dua      tiga     empat      lima
A -0.450176  0.132428  0.022214  0.317368 -0.752414
C -1.271023  1.586171  0.693391 -1.958081 -0.134801

In [48]:
hasil = dataku[dataku['lima'] > 0]

In [49]:
hasil

Empty DataFrame
Columns: [satu, dua, tiga, empat, lima]
Index: []

# Kapal Titanic

In [50]:
dataku = pd.read_csv('kapal_titanic.csv')

In [51]:
dataku

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [54]:
age = dataku.age

In [55]:
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [56]:
age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

In [57]:
age.count()

714